In [1]:
import sqlalchemy as sa
import pandas as pd

In [2]:
conn_string = "postgresql://irs1318:irs1318@localhost:5432/scouting"
engine = sa.create_engine(conn_string)
conn = engine.connect()

In [3]:
msrs = pd.read_sql("SELECT * FROM measures;", conn)

In [4]:
msrs.head()

,date_id,event_id,level_id,match_id,alliance_id,team_id,station_id,actor_id,task_id,measuretype_id,phase_id,attempt_id,reason_id,capability,attempts,successes,cycle_times
0,4261,4249,1,2,3,1,2,3,4,4,3,1,1,0,0,0,0
1,4255,4249,1,1,3,36,4,3,19,4,5,1,1,0,1,1,0
2,4261,4249,1,2,3,1,2,3,448,4,4,1,1,0,0,0,0
3,4261,4249,1,2,3,1,2,3,2,4,4,1,1,0,0,0,0
4,4255,4249,1,1,3,940,3,3,18,2,5,1,1,0,8,8,0

In [5]:
sql = sa.text("""
SELECT sum(measures.successes)
FROM phases INNER JOIN
	        (tasks INNER JOIN
	               (measures INNER JOIN teams
				   ON measures.team_id = teams.id)
	 		 ON tasks.id = measures.task_id)
	ON phases.id = measures.phase_id
					   
WHERE teams.name = '1318' AND
      tasks.name = 'placeScale' AND
	  phases.name = 'auto';
""")
pCubes = pd.read_sql(sql, conn)
pCubes

   sum
0   34

In [6]:
sql = sa.text("""
SELECT teams.city, sum(measures.successes) AS climbs
  FROM teams INNER JOIN
	         (events INNER JOIN
	 	             (tasks INNER JOIN measures ON measures.task_id = tasks.id)
	         ON events.id = measures.event_id)
  ON teams.id = measures.team_id
WHERE events.name = 'pncmp' AND events.season = '2018'
  AND tasks.name = 'makeClimb'
GROUP BY teams.city
ORDER BY climbs DESC;
""")
pCubes = pd.read_sql(sql, conn)
pCubes

                 city  climbs
0             Seattle      25
1                None      13
2        Medical Lake      10
3         Wilsonville      10
4               Camas       9
5             Spokane       9
6            Issaquah       8
7       Battle Ground       8
8              Tacoma       8
9              Sequim       8
10          Hillsboro       8
11       Maple Valley       7
12         Hood River       7
13          Philomath       6
14        Federal Way       6
15          Corvallis       6
16           Bellevue       6
17         Trout Lake       5
18            Bothell       5
19       Saint Helens       5
20             Eugene       5
21  Bainbridge Island       5
22            Olympia       5
23       Kettle Falls       4
24        Bonney Lake       4
25            Everett       3
26            Lebanon       3
27          Anacortes       2
28          Snohomish       2
29         Mill Creek       2
30          Vancouver       1
31          Northport       0
32         Bellingham       0
33           Lynnwood       0
34            Pullman       0
35            Ashland       0
36           Portland       0
37          Scappoose       0
38            Palouse       0